In [7]:
import pandas as pd
df1 = pd.DataFrame({
    'name':['ram','shyam'],
    'age':['10','20']
})
df2 = pd.DataFrame({
    'name':['hari','gopal'],
    'age':[55,65],
})

df = pd.concat([df1,df2])

In [8]:
df

    name age
0    ram  10
1  shyam  20
0   hari  55
1  gopal  65

In [9]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp39-cp39-win_amd64.whl size=247961 sha256=964c7ceef65fe6ae6631124ac7d2f6be3afc62f256b04f0a4163078df6f5a490
  Stored in directory: c:\users\user\appdata\local\pip\cache\wheels\7b\14\39\5aad423666e827dfe9a1fbcd111ac17171e7c9865d570780ce
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [11]:
print("hi")

hi

In [6]:
import mysql.connector
database = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database="python_broadway")

db = database.cursor()

In [7]:
db.execute("SELECT * FROM students")
result =db.fetchall()
result

[(1, 'Samyak', 89, 90, 50, 99, 99, 400, 75.2, 'A'),
 (2, 'manandhar', 50, 50, 50, 50, 50, 60, 52.0, 'D'),
 (3, 'manandhar', 50, 50, 50, 50, 50, 252, 52.0, 'D')]

In [8]:
db.execute("SELECT name,grade FROM students")
result1 = db.fetchall() 
result1

[('Samyak', 'A'), ('manandhar', 'D'), ('manandhar', 'D')]

In [9]:
db.execute("SELECT * FROM students where grade ='A'")
result2 = db.fetchall()
result2

[(1, 'Samyak', 89, 90, 50, 99, 99, 400, 75.2, 'A')]

In [11]:
sql = '''INSERT INTO `students` (`sn`, `name`, `physics`, `chemistry`, `maths`, `english`, `nepali`, `total`, `percentage`, `grade`) VALUES ('4', 'manandhar', '50', '50', '50', '50', '50', '60', '52', 'D');'''
db.execute(sql)
database.commit()

In [16]:
name = input("enter name")
physics = int(input("enter marks in maths"))
chemistry = int(input("enter marks in maths"))
maths = int(input("enter marks in eng"))
english = int(input("enter marks in nep"))
nepali = int(input("enter marks in nep"))
total = maths + physics + chemistry +english + nepali
percentage = total/5
if percentage>=80:
    grade = 'a' 
elif per>=60:
    grade = 'b'
elif per>=40:
    grade = 'c'
else:
    grade = 'f'

print("total",total)
print("per",percentage)
    
sql = f"INSERT INTO students (name,physics,chemistry,maths,english,nepali,total,percentage,grade) VALUES('{name}',{physics},{chemistry},{maths},{english},{nepali},{total},{percentage},'{grade}')"
db.execute(sql)
database.commit()

enter namesamyakkkkkkkkkkk
enter marks in maths90
enter marks in maths54
enter marks in eng45
enter marks in nep841
enter marks in nep4
total 1034
per 206.8